[
  {
    "name": "Barbell Bench Press",
    "description": "The barbell bench press is a classic exercise popular among all weight lifting circles. From bodybuilders to powerlifters, the bench press is a staple chest exercise in nearly every workout program. For powerlifters, it is known as one of the big three lifts which includes the squat, deadlift, and bench press. For athletes, 1 rep max on bench press is a good indicator for on field/court performance. And for bodybuilders, the bench press is a compound exercise that targets many of the muscles in your upper body",
    "primaryMuscle": "Chest",
    "secondary": "Triceps",
    "img": "images/barbell-bench-press.png"
  },
  {
    "name": "Dumbbell Bench Press",
    "description": "The dumbbell bench press is an effective variation of the bench press that provides additional stabilization and engagement of the core muscles. By using dumbbells, each arm works independently, which can help identify and correct strength imbalances. It targets the chest and triceps and is a popular choice among bodybuilders and fitness enthusiasts.",
    "primaryMuscle": "Chest",
    "secondary": "Arms",
    "img": "images/dumbbell-bench-press.png"
  },
  {
    "name": "Incline Dumbbell Bench Press",
    "description": "The incline dumbbell bench press primarily targets the upper chest muscles. By adjusting the bench to an inclined angle, you shift the emphasis to the clavicular head of the pectoralis major. It also engages the front deltoids and triceps to a lesser extent. This exercise is popular for developing a well-rounded chest.",
    "primaryMuscle": "Chest",
    "secondary": "Triceps",
    "img": "images/incline-dumbbell-bench-press.png"
  },
  {
    "name": "Pec Flys",
    "description": "Pec flys, also known as the chest fly, is an isolation exercise that targets the pectoral muscles. It involves bringing the arms together in a semicircular motion against resistance, mimicking the motion of hugging a large tree. Pec flys help in developing the chest and are commonly used in chest-focused workouts.",
    "primaryMuscle": "Chest",
    "secondary": "Anterior Deltoids",
    "img": "images/pec-flys.png"
  },
  {
    "name": "Dumbbell Shoulder Press",
    "description": "The dumbbell shoulder press is an excellent exercise for building shoulder strength and muscle. It targets the anterior deltoids primarily and also engages the triceps and upper back muscles for stabilization. By using dumbbells, you can work each arm independently, helping to balance strength and muscle development.",
    "primaryMuscle": "Shoulders",
    "secondary": "Triceps",
    "img": "images/dumbbell-shoulder-press.png"
  },
  {
    "name": "Push Up",
    "description": "The push-up is a fundamental bodyweight exercise that targets the chest, shoulders, and triceps. It is an excellent calisthenic exercise for building upper body strength and stability. The push-up can be modified to suit various fitness levels, making it a versatile exercise for most individuals.",
    "primaryMuscle": "Chest",
    "secondary": "Shoulders",
    "img": "images/push-up.png"
  },
  {
    "name": "Dumbbell Lateral Raises",
    "description": "Dumbbell lateral raises are isolation exercises that target the lateral (side) deltoids. They help in building shoulder width and strength. By lifting dumbbells to the sides, you engage the lateral deltoids without involving other muscle groups, making it an effective exercise for developing well-rounded shoulders.",
    "primaryMuscle": "Shoulders",
    "secondary": "None",
    "img": "images/dumbbell-lateral-raises.png"
  },
  {
    "name": "Pull Up",
    "description": "The pull-up is a challenging bodyweight exercise that targets the upper back, specifically the latissimus dorsi (lats), as well as the biceps and shoulders. It is a compound exercise that requires a strong grip and upper body strength. Pull-ups are great for building a V-shaped back and improving overall upper body muscularity.",
    "primaryMuscle": "Back",
    "secondary": "Biceps",
    "img": "images/pull-up.png"
  },
  {
    "name": "Barbell Row",
    "description": "The barbell row, also known as the bent-over barbell row, is a compound exercise that primarily targets the muscles of the upper back, including the latissimus dorsi, rhomboids, and traps. It also engages the biceps and rear deltoids. The barbell row is effective for building back strength and thickness.",
    "primaryMuscle": "Back",
    "secondary": "Biceps",
    "img": "images/barbell-row.png"
  },
  {
    "name": "Lat Pulldown",
    "description": "The lat pulldown is a machine-based exercise that targets the latissimus dorsi (lats), which are the large muscles of the back. It also engages the biceps and rear deltoids to a lesser extent. The lat pulldown is an effective substitute for pull-ups and is a staple in many back-focused workout routines.",
    "primaryMuscle": "Back",
    "secondary": "Biceps",
    "img": "images/lat-pulldown.png"
  },
  {
    "name": "Triceps Pushdown",
    "description": "The triceps pushdown is an isolation exercise that targets the triceps, the muscles on the back of the upper arm. It involves pushing a cable bar down while keeping the upper arms stationary. The triceps pushdown is a popular exercise for building strong and defined triceps.",
    "primaryMuscle": "Arms",
    "secondary": "None",
    "img": "images/triceps-pushdown.png"
  },
  {
    "name": "Triceps Extensions",
    "description": "Triceps extensions, also known as skull crushers, are compound exercises that target the triceps. By lowering a barbell or dumbbells to the forehead while keeping the elbows stationary, you engage the triceps and other stabilizing muscles. Triceps extensions are effective for building size and strength in the triceps.",
    "primaryMuscle": "Arms",
    "secondary": "None",
    "img": "images/triceps-extensions.png"
  },
  {
    "name": "Dumbbell Hammer Curl",
    "description": "The dumbbell hammer curl is a variation of the traditional bicep curl. It targets the brachialis muscle, which lies underneath the biceps, and also works the forearms. The hammer curl gets its name from the hammer-like grip used during the exercise. This exercise is beneficial for overall arm development.",
    "primaryMuscle": "Arms",
    "secondary": "Forearms",
    "img": "images/dumbbell-hammer-curl.png"
  },
  {
    "name": "Barbell Curl",
    "description": "The barbell curl is a classic bicep exercise that targets the biceps brachii muscle. By curling a barbell upwards while keeping the elbows stationary, you isolate and engage the biceps. The barbell curl is a popular exercise for building bicep size and strength.",
    "primaryMuscle": "Arms",
    "secondary": "None",
    "img": "images/barbell-curl.png"
  },
  {
    "name": "Squat",
    "description": "The squat is one of the most fundamental and effective lower body exercises, popular in powerlifting and strength training circles. It primarily targets the quadriceps, hamstrings, and glutes, but also engages the core and lower back for stability. Squats are essential for building lower body strength, power, and overall athleticism, making them a staple in powerlifting competitions and training programs.",
    "primaryMuscle": "Legs",
    "secondary": "Hamstrings, Glutes",
    "img": "images/squat.png"
  },
  {
    "name": "Deadlift",
    "description": "The deadlift is a compound exercise that targets multiple muscle groups, including the lower back, glutes, hamstrings, and grip muscles. It is widely embraced in powerlifting as one of the three main lifts, alongside the squat and bench press. The deadlift involves lifting a loaded barbell from the ground to a standing position, and it is highly effective for building overall strength and functional fitness. Powerlifters often train specifically to improve their deadlift numbers, as it is a critical component of powerlifting competitions.",
    "primaryMuscle": "Legs",
    "secondary": "Glutes, Hamstrings",
    "img": "images/deadlift.png"
  },
  {
    "name": "Hamstring Curl",
    "description": "The hamstring curl, also known as the leg curl, is an isolation exercise that targets the hamstrings. It involves curling the lower legs upward against resistance while lying face down on a leg curl machine. The hamstring curl is effective for strengthening the hamstrings.",
    "primaryMuscle": "Legs",
    "secondary": "None",
    "img": "images/hamstring-curl.png"
  },
  {
    "name": "Leg Extensions",
    "description": "Leg extensions are isolation exercises that primarily target the quadriceps. The exercise involves extending the legs against resistance while seated on a leg extension machine. Leg extensions are commonly used for building strength and definition in the quadriceps muscles.",
    "primaryMuscle": "Legs",
    "secondary": "None",
    "img": "images/leg-extensions.png"
  }
]
